# Importing Pandas

In [1]:
import pandas as pd

# Importing data, assining it to a variable 'users' and using 'user_id' as index

In [144]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep = '|')
users = users.set_index('user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

# See the first 10 and last 10 entries

In [148]:
print('--------First 10 entries -------\n',users.head(10),'\n--------Last 10 entries -------\n',users.tail(10))

--------First 10 entries -------
          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
--------Last 10 entries -------
          age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# What is the number of observations in the dataset?

In [154]:
print('Number of observations :',users.shape[0])

# or

# print('Number of observations :',users.count()[0])

Number of observations : 943

# What is the number of columns in the dataset?

In [44]:
print('Number of columns :',users.shape[1])

Number of columns : 4

# Print the name of all the columns.

In [88]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# How is the dataset indexed?

In [59]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

# What is the data type of each column?

In [156]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# Print only the occupation column

In [63]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# How many different occupations are in this dataset?

In [92]:
users['occupation'].nunique()

21

# What is the most frequent occupation?

In [97]:
users['occupation'].mode()[0]

'student'

# DataFrame Info.

In [99]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

# Describe all the columns

In [173]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [171]:
# For all columns

print('Age :\n',users['age'].describe())
print('\nGender :\n',users['gender'].describe())
print('\nOccupation :\n',users['occupation'].describe())
print('\nZip_code :\n',users['zip_code'].describe())

Age :
 count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

Gender :
 count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

Occupation :
 count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

Zip_code :
 count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object

# Summarize only the occupation column

In [124]:
users['occupation'].value_counts()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

# What is the mean age of users?

In [128]:
users['age'].mean()

34.05196182396607

# What is the age with least occurrence?

In [142]:
users['age'].value_counts().idxmin()

7